
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |       47 |          66 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                              |
|:--------:|:-------------------------------------------------------------------------------------------------------|
|    🟢    | `module.repos["terraform-aws-actions-runner"].github_repository_file.checkov_workflow[0]`              |
|    🟢    | `module.repos["terraform-aws-bookstack"].github_repository_file.checkov_workflow[0]`                   |
|    🟢    | `module.repos["terraform-aws-ci-cd"].github_repository_file.checkov_workflow[0]`                       |
|    🟢    | `module.repos["terraform-aws-cloud-init"].github_repository_file.checkov_workflow[0]`                  |
|    🟢    | `module.repos["terraform-aws-cloudcraft-role"].github_repository_file.checkov_workflow[0]`             |
|    🟢    | `module.repos["terraform-aws-cost-alert"].github_repository_file.checkov_workflow[0]`                  |
|    🟢    | `module.repos["terraform-aws-debian-repo"].github_repository_file.checkov_workflow[0]`                 |
|    🟢    | `module.repos["terraform-aws-dms"].github_repository_file.checkov_workflow[0]`                         |
|    🟢    | `module.repos["terraform-aws-ecr"].github_repository_file.checkov_workflow[0]`                         |
|    🟢    | `module.repos["terraform-aws-ecs"].github_repository_file.checkov_workflow[0]`                         |
|    🟢    | `module.repos["terraform-aws-elasticsearch"].github_repository_file.checkov_workflow[0]`               |
|    🟢    | `module.repos["terraform-aws-emrserverless"].github_repository_file.checkov_workflow[0]`               |
|    🟢    | `module.repos["terraform-aws-gh-identity-provider"].github_repository_file.checkov_workflow[0]`        |
|    🟢    | `module.repos["terraform-aws-gha-admin"].github_repository_file.checkov_workflow[0]`                   |
|    🟢    | `module.repos["terraform-aws-github-backup"].github_repository_file.checkov_workflow[0]`               |
|    🟢    | `module.repos["terraform-aws-github-backup-configuration"].github_repository_file.checkov_workflow[0]` |
|    🟢    | `module.repos["terraform-aws-github-role"].github_repository_file.checkov_workflow[0]`                 |
|    🟢    | `module.repos["terraform-aws-guardduty-configuration"].github_repository_file.checkov_workflow[0]`     |
|    🟢    | `module.repos["terraform-aws-http-redirect"].github_repository_file.checkov_workflow[0]`               |
|    🟢    | `module.repos["terraform-aws-instance-profile"].github_repository_file.checkov_workflow[0]`            |
|    🟢    | `module.repos["terraform-aws-iso27001"].github_repository_file.checkov_workflow[0]`                    |
|    🟢    | `module.repos["terraform-aws-jumphost"].github_repository_file.checkov_workflow[0]`                    |
|    🟢    | `module.repos["terraform-aws-key"].github_repository_file.checkov_workflow[0]`                         |
|    🟢    | `module.repos["terraform-aws-kibana"].github_repository_file.checkov_workflow[0]`                      |
|    🟢    | `module.repos["terraform-aws-lambda-monitored"].github_repository_file.checkov_workflow[0]`            |
|    🟢    | `module.repos["terraform-aws-openvpn"].github_repository_file.checkov_workflow[0]`                     |
|    🟢    | `module.repos["terraform-aws-percona-server"].github_repository_file.checkov_workflow[0]`              |
|    🟢    | `module.repos["terraform-aws-pmm-ecs"].github_repository_file.checkov_workflow[0]`                     |
|    🟢    | `module.repos["terraform-aws-postfix"].github_repository_file.checkov_workflow[0]`                     |
|    🟢    | `module.repos["terraform-aws-pypiserver"].github_repository_file.checkov_workflow[0]`                  |
|    🟢    | `module.repos["terraform-aws-registry"].github_repository_file.checkov_workflow[0]`                    |
|    🟢    | `module.repos["terraform-aws-s3-bucket"].github_repository_file.checkov_workflow[0]`                   |
|    🟢    | `module.repos["terraform-aws-secret"].github_repository_file.checkov_workflow[0]`                      |
|    🟢    | `module.repos["terraform-aws-secret-policy"].github_repository_file.checkov_workflow[0]`               |
|    🟢    | `module.repos["terraform-aws-service-network"].github_repository_file.checkov_workflow[0]`             |
|    🟢    | `module.repos["terraform-aws-sqs-ecs"].github_repository_file.checkov_workflow[0]`                     |
|    🟢    | `module.repos["terraform-aws-sqs-pod"].github_repository_file.checkov_workflow[0]`                     |
|    🟢    | `module.repos["terraform-aws-state-bucket"].github_repository_file.checkov_workflow[0]`                |
|    🟢    | `module.repos["terraform-aws-state-manager"].github_repository_file.checkov_workflow[0]`               |
|    🟢    | `module.repos["terraform-aws-tags-override"].github_repository_file.checkov_workflow[0]`               |
|    🟢    | `module.repos["terraform-aws-tcp-pod"].github_repository_file.checkov_workflow[0]`                     |
|    🟢    | `module.repos["terraform-aws-teleport"].github_repository_file.checkov_workflow[0]`                    |
|    🟢    | `module.repos["terraform-aws-teleport-agent"].github_repository_file.checkov_workflow[0]`              |
|    🟢    | `module.repos["terraform-aws-terraformer"].github_repository_file.checkov_workflow[0]`                 |
|    🟢    | `module.repos["terraform-aws-truststore"].github_repository_file.checkov_workflow[0]`                  |
|    🟢    | `module.repos["terraform-aws-update-dns"].github_repository_file.checkov_workflow[0]`                  |
|    🟢    | `module.repos["terraform-aws-website-pod"].github_repository_file.checkov_workflow[0]`                 |
|    🟡    | `module.infrahouse-github-backup.aws_iam_role.infrahouse-backup`                                       |
|    🟡    | `module.repos["aws-control"].github_repository_file.renovate_json`                                     |
|    🟡    | `module.repos["aws-control-289256138624"].github_repository_file.renovate_json`                        |
|    🟡    | `module.repos["aws-control-303467602807"].github_repository_file.renovate_json`                        |
|    🟡    | `module.repos["aws-control-493370826424"].github_repository_file.renovate_json`                        |
|    🟡    | `module.repos["cookiecutter-github-control"].github_repository_file.renovate_json`                     |
|    🟡    | `module.repos["hiera-aws-sm"].github_repository_file.renovate_json`                                    |
|    🟡    | `module.repos["homebrew-infrahouse-toolkit"].github_repository_file.renovate_json`                     |
|    🟡    | `module.repos["infrahouse-com"].github_repository_file.renovate_json`                                  |
|    🟡    | `module.repos["infrahouse-core"].github_repository_file.renovate_json`                                 |
|    🟡    | `module.repos["infrahouse-puppet-data"].github_repository_file.renovate_json`                          |
|    🟡    | `module.repos["infrahouse-toolkit"].github_repository_file.renovate_json`                              |
|    🟡    | `module.repos["infrahouse-ubuntu-pro"].github_repository_file.renovate_json`                           |
|    🟡    | `module.repos["infrahouse-website-infra"].github_repository_file.renovate_json`                        |
|    🟡    | `module.repos["osv-scanner"].github_repository_file.renovate_json`                                     |
|    🟡    | `module.repos["prometheus-elasticsearch-exporter"].github_repository_file.renovate_json`               |
|    🟡    | `module.repos["proxysql-sandbox"].github_repository_file.renovate_json`                                |
|    🟡    | `module.repos["puppet-code"].github_repository_file.renovate_json`                                     |
|    🟡    | `module.repos["pytest-infrahouse"].github_repository_file.renovate_json`                               |
|    🟡    | `module.repos["terraform-aws-actions-runner"].github_repository_file.renovate_json`                    |
|    🟡    | `module.repos["terraform-aws-bookstack"].github_repository_file.renovate_json`                         |
|    🟡    | `module.repos["terraform-aws-ci-cd"].github_repository_file.renovate_json`                             |
|    🟡    | `module.repos["terraform-aws-cloud-init"].github_repository_file.renovate_json`                        |
|    🟡    | `module.repos["terraform-aws-cloudcraft-role"].github_repository_file.renovate_json`                   |
|    🟡    | `module.repos["terraform-aws-cost-alert"].github_repository_file.renovate_json`                        |
|    🟡    | `module.repos["terraform-aws-debian-repo"].github_repository_file.renovate_json`                       |
|    🟡    | `module.repos["terraform-aws-dms"].github_repository_file.renovate_json`                               |
|    🟡    | `module.repos["terraform-aws-ecr"].github_repository_file.renovate_json`                               |
|    🟡    | `module.repos["terraform-aws-ecs"].github_repository_file.renovate_json`                               |
|    🟡    | `module.repos["terraform-aws-elasticsearch"].github_repository_file.renovate_json`                     |
|    🟡    | `module.repos["terraform-aws-emrserverless"].github_repository_file.renovate_json`                     |
|    🟡    | `module.repos["terraform-aws-gh-identity-provider"].github_repository_file.renovate_json`              |
|    🟡    | `module.repos["terraform-aws-gha-admin"].github_repository_file.renovate_json`                         |
|    🟡    | `module.repos["terraform-aws-github-backup"].github_repository_file.renovate_json`                     |
|    🟡    | `module.repos["terraform-aws-github-backup-configuration"].github_repository_file.renovate_json`       |
|    🟡    | `module.repos["terraform-aws-github-role"].github_repository_file.renovate_json`                       |
|    🟡    | `module.repos["terraform-aws-guardduty-configuration"].github_repository_file.renovate_json`           |
|    🟡    | `module.repos["terraform-aws-http-redirect"].github_repository_file.renovate_json`                     |
|    🟡    | `module.repos["terraform-aws-instance-profile"].github_repository_file.renovate_json`                  |
|    🟡    | `module.repos["terraform-aws-iso27001"].github_repository_file.renovate_json`                          |
|    🟡    | `module.repos["terraform-aws-jumphost"].github_repository_file.renovate_json`                          |
|    🟡    | `module.repos["terraform-aws-key"].github_repository_file.renovate_json`                               |
|    🟡    | `module.repos["terraform-aws-kibana"].github_repository_file.renovate_json`                            |
|    🟡    | `module.repos["terraform-aws-lambda-monitored"].github_repository_file.renovate_json`                  |
|    🟡    | `module.repos["terraform-aws-openvpn"].github_repository_file.renovate_json`                           |
|    🟡    | `module.repos["terraform-aws-percona-server"].github_repository_file.renovate_json`                    |
|    🟡    | `module.repos["terraform-aws-pmm-ecs"].github_repository_file.renovate_json`                           |
|    🟡    | `module.repos["terraform-aws-postfix"].github_repository_file.renovate_json`                           |
|    🟡    | `module.repos["terraform-aws-pypiserver"].github_repository_file.renovate_json`                        |
|    🟡    | `module.repos["terraform-aws-registry"].github_repository_file.renovate_json`                          |
|    🟡    | `module.repos["terraform-aws-s3-bucket"].github_repository_file.renovate_json`                         |
|    🟡    | `module.repos["terraform-aws-secret"].github_repository_file.renovate_json`                            |
|    🟡    | `module.repos["terraform-aws-secret-policy"].github_repository_file.renovate_json`                     |
|    🟡    | `module.repos["terraform-aws-service-network"].github_repository_file.renovate_json`                   |
|    🟡    | `module.repos["terraform-aws-sqs-ecs"].github_repository_file.renovate_json`                           |
|    🟡    | `module.repos["terraform-aws-sqs-pod"].github_repository_file.renovate_json`                           |
|    🟡    | `module.repos["terraform-aws-state-bucket"].github_repository_file.renovate_json`                      |
|    🟡    | `module.repos["terraform-aws-state-manager"].github_repository_file.renovate_json`                     |
|    🟡    | `module.repos["terraform-aws-tags-override"].github_repository_file.renovate_json`                     |
|    🟡    | `module.repos["terraform-aws-tcp-pod"].github_repository_file.renovate_json`                           |
|    🟡    | `module.repos["terraform-aws-teleport"].github_repository_file.renovate_json`                          |
|    🟡    | `module.repos["terraform-aws-teleport-agent"].github_repository_file.renovate_json`                    |
|    🟡    | `module.repos["terraform-aws-terraformer"].github_repository_file.renovate_json`                       |
|    🟡    | `module.repos["terraform-aws-truststore"].github_repository_file.renovate_json`                        |
|    🟡    | `module.repos["terraform-aws-update-dns"].github_repository_file.renovate_json`                        |
|    🟡    | `module.repos["terraform-aws-website-pod"].github_repository_file.renovate_json`                       |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.infrahouse-github-backup.aws_iam_role.infrahouse-backup will be updated in-place
  ~ resource "aws_iam_role" "infrahouse-backup" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "AROAXFXZRL24BXTVLXRTA" -> "arn:aws:iam::493370826424:role/infrahouse-github-backup"
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "infrahouse-backup-20241007015742530900000001"
        name                  = "infrahouse-backup-20241007015742530900000001"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # module.repos["aws-control"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "aws-control/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["aws-control-289256138624"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "aws-control-289256138624/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["aws-control-303467602807"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "aws-control-303467602807/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["aws-control-493370826424"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "aws-control-493370826424/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["cookiecutter-github-control"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "cookiecutter-github-control/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["hiera-aws-sm"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "hiera-aws-sm/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["homebrew-infrahouse-toolkit"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "homebrew-infrahouse-toolkit/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["infrahouse-com"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "infrahouse-com/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["infrahouse-core"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "infrahouse-core/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["infrahouse-puppet-data"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "infrahouse-puppet-data/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["infrahouse-toolkit"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "infrahouse-toolkit/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["infrahouse-ubuntu-pro"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "infrahouse-ubuntu-pro/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["infrahouse-website-infra"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "infrahouse-website-infra/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["osv-scanner"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "osv-scanner/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["prometheus-elasticsearch-exporter"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "prometheus-elasticsearch-exporter/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["proxysql-sandbox"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "proxysql-sandbox/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["puppet-code"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "puppet-code/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["pytest-infrahouse"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "pytest-infrahouse/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-actions-runner"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-actions-runner"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-actions-runner"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-actions-runner/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-bookstack"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-bookstack"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-bookstack"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-bookstack/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-ci-cd"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-ci-cd"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-ci-cd"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-ci-cd/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-cloud-init"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-cloud-init"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-cloud-init"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-cloud-init/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-cloudcraft-role"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-cloudcraft-role"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-cloudcraft-role"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-cloudcraft-role/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-cost-alert"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-cost-alert"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-cost-alert"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-cost-alert/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-debian-repo"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-debian-repo"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-debian-repo"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-debian-repo/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-dms"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-dms"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-dms"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-dms/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-ecr"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-ecr"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-ecr"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-ecr/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-ecs"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-ecs"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-ecs"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-ecs/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-elasticsearch"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-elasticsearch"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-elasticsearch"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-elasticsearch/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-emrserverless"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-emrserverless"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-emrserverless"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-emrserverless/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-gh-identity-provider"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-gh-identity-provider"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-gh-identity-provider"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-gh-identity-provider/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-gha-admin"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-gha-admin"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-gha-admin"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-gha-admin/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-github-backup"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-github-backup"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-github-backup"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-github-backup/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-github-backup-configuration"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-github-backup-configuration"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-github-backup-configuration"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-github-backup-configuration/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-github-role"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-github-role"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-github-role"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-github-role/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-guardduty-configuration"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-guardduty-configuration"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-guardduty-configuration"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-guardduty-configuration/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-http-redirect"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-http-redirect"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-http-redirect"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-http-redirect/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-instance-profile"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-instance-profile"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-instance-profile"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-instance-profile/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-iso27001"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-iso27001"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-iso27001"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-iso27001/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-jumphost"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-jumphost"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-jumphost"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-jumphost/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-key"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-key"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-key"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-key/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-kibana"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-kibana"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-kibana"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-kibana/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-lambda-monitored"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-lambda-monitored"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-lambda-monitored"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-lambda-monitored/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-openvpn"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-openvpn"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-openvpn"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-openvpn/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-percona-server"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-percona-server"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-percona-server"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-percona-server/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-pmm-ecs"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-pmm-ecs"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-pmm-ecs"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-pmm-ecs/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-postfix"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-postfix"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-postfix"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-postfix/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-pypiserver"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-pypiserver"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-pypiserver"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-pypiserver/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-registry"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-registry"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-registry"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-registry/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-s3-bucket"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-s3-bucket"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-s3-bucket"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-s3-bucket/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-secret"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-secret"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-secret"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-secret/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-secret-policy"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-secret-policy"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-secret-policy"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-secret-policy/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-service-network"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-service-network"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-service-network"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-service-network/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-sqs-ecs"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-sqs-ecs"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-sqs-ecs"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-sqs-ecs/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-sqs-pod"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-sqs-pod"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-sqs-pod"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-sqs-pod/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-state-bucket"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-state-bucket"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-state-bucket"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-state-bucket/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-state-manager"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-state-manager"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-state-manager"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-state-manager/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-tags-override"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-tags-override"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-tags-override"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-tags-override/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-tcp-pod"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-tcp-pod"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-tcp-pod"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-tcp-pod/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-teleport"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-teleport"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-teleport"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-teleport/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-teleport-agent"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-teleport-agent"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-teleport-agent"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-teleport-agent/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-terraformer"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-terraformer"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-terraformer"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-terraformer/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-truststore"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-truststore"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-truststore"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-truststore/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-update-dns"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-update-dns"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-update-dns"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-update-dns/renovate.json"
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-website-pod"].github_repository_file.checkov_workflow[0] will be created
  + resource "github_repository_file" "checkov_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add checkov.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            ---
            name: Checkov Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              contents: read
              security-events: write
            
            jobs:
              checkov:
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v4
                  - uses: bridgecrewio/checkov-action@v12
                    with:
                      config_file: .checkov.yml
        EOT
      + file                         = "./.github/workflows/checkov.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-website-pod"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-website-pod"].github_repository_file.renovate_json will be updated in-place
  ~ resource "github_repository_file" "renovate_json" {
      ~ content             = jsonencode(
          ~ {
              ~ packageRules      = [
                  ~ {
                      ~ matchFileNames = [
                          + ".github/workflows/checkov.yml",
                            ".github/workflows/terraform-CI.yml",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
        id                  = "terraform-aws-website-pod/renovate.json"
        # (7 unchanged attributes hidden)
    }

Plan: 47 to add, 66 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAiYWRkIjogNDcsICJjaGFuZ2UiOiA2NiwgImRlc3Ryb3kiOiAwfX0=
```
</details>